In [1]:
import pandas as pd
import xlrd
import numpy as np
import sidetable as stb
#import sys
#!{sys.executable} -m pip install seaborn

Requirement already satisfied: seaborn in /Users/madelineluong/opt/anaconda3/lib/python3.8/site-packages (0.10.1)
Requirement already satisfied: scipy>=1.0.1 in /Users/madelineluong/opt/anaconda3/lib/python3.8/site-packages (from seaborn) (1.5.0)
Requirement already satisfied: pandas>=0.22.0 in /Users/madelineluong/opt/anaconda3/lib/python3.8/site-packages (from seaborn) (1.0.5)
Requirement already satisfied: numpy>=1.13.3 in /Users/madelineluong/opt/anaconda3/lib/python3.8/site-packages (from seaborn) (1.18.5)
Requirement already satisfied: matplotlib>=2.1.2 in /Users/madelineluong/opt/anaconda3/lib/python3.8/site-packages (from seaborn) (3.2.2)
Requirement already satisfied: python-dateutil>=2.6.1 in /Users/madelineluong/opt/anaconda3/lib/python3.8/site-packages (from pandas>=0.22.0->seaborn) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in /Users/madelineluong/opt/anaconda3/lib/python3.8/site-packages (from pandas>=0.22.0->seaborn) (2020.1)
Requirement already satisfied: kiwisolver>=1.0.1 in /Users/madelineluong/opt/anaconda3/lib/python3.8/site-packages (from matplotlib>=2.1.2->seaborn) (1.2.0)
Requirement already satisfied: cycler>=0.10 in /Users/madelineluong/opt/anaconda3/lib/python3.8/site-packages (from matplotlib>=2.1.2->seaborn) (0.10.0)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.1 in /Users/madelineluong/opt/anaconda3/lib/python3.8/site-packages (from matplotlib>=2.1.2->seaborn) (2.4.7)
Requirement already satisfied: six>=1.5 in /Users/madelineluong/opt/anaconda3/lib/python3.8/site-packages (from python-dateutil>=2.6.1->pandas>=0.22.0->seaborn) (1.15.0)

In [33]:
df = pd.read_excel('Transaction.xlsx') # reading file
df.head() # showing the first 4 rows
df.info() # checking each dtype we can see that product first sold date is weird

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

In [20]:
df['product_first_sold_date']=pd.to_datetime(df['product_first_sold_date']).dt.date # changing to date

In [21]:
df.describe() # we can see some missing values here

,transaction_id,product_id,customer_id,online_order,list_price,standard_cost
count,20000.000000,20000.00000,20000.000000,19640.000000,20000.000000,19803.000000
mean,10000.500000,45.36465,1738.246050,0.500458,1107.829449,556.046951
std,5773.647028,30.75359,1011.951046,0.500013,582.825242,405.955660
min,1.000000,0.00000,1.000000,0.000000,12.010000,7.210000
25%,5000.750000,18.00000,857.750000,0.000000,575.270000,215.140000
50%,10000.500000,44.00000,1736.000000,1.000000,1163.890000,507.580000
75%,15000.250000,72.00000,2613.000000,1.000000,1635.300000,795.100000
max,20000.000000,100.00000,5034.000000,1.000000,2091.470000,1759.850000

In [22]:
df.isnull().sum() # finding NA values for each column

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [23]:
df.columns # checking all indexs

Index(['transaction_id', 'product_id', 'customer_id', 'transaction_date',
       'online_order', 'order_status', 'brand', 'product_line',
       'product_class', 'product_size', 'list_price', 'standard_cost',
       'product_first_sold_date'],
      dtype='object')

In [24]:
df['order_status'].value_counts() # seeing unique values

Approved     19821
Cancelled      179
Name: order_status, dtype: int64

In [25]:
df['brand'].value_counts() # seeings different values in this column this is fine

Solex             4253
Giant Bicycles    3312
WeareA2B          3295
OHM Cycles        3043
Trek Bicycles     2990
Norco Bicycles    2910
Name: brand, dtype: int64

In [26]:
dup = df.duplicated() # finding duplicated values
df[dup].sum() # we can see there is not duplicated values everything is 0

transaction_id             0.0
product_id                 0.0
customer_id                0.0
transaction_date           0.0
online_order               0.0
order_status               0.0
brand                      0.0
product_line               0.0
product_class              0.0
product_size               0.0
list_price                 0.0
standard_cost              0.0
product_first_sold_date    0.0
dtype: float64

In [27]:
df1= pd.read_excel('CostomerDemographic.xlsx') # running the next excel sheet

In [28]:
df1.head() # showing the first few lines

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,720,Darrel,Canet,Male,67,1931-10-23,Recruiting Manager,Retail,Affluent Customer,N,1;DROP TABLE users,No,6.0
1,1092,Katlin,Creddon,Female,56,1935-08-22,VP Quality Control,Retail,Mass Customer,N,ì¬íê³¼íì ì´íì°êµ¬ì,No,5.0
2,3410,Merrili,Brittin,Female,93,1940-09-22,NaN,Property,Mass Customer,N,á,No,16.0
3,2413,Abbey,Murrow,Male,27,1943-08-11,Environmental Specialist,Manufacturing,High Net Worth,N,á,Yes,17.0
4,658,Donn,Bonnell,Male,38,1944-01-24,Tax Accountant,Manufacturing,Affluent Customer,N,ì¬íê³¼íì ì´íì°êµ¬ì,Yes,8.0

In [29]:
df1.columns # we can see here that default needs to be taken out, it has weird values

Index(['customer_id', 'first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'default', 'owns_car', 'tenure'],
      dtype='object')

In [30]:
df1= df1.drop('default',axis=1) # taking out default column

In [31]:
df1.describe() # we can see that there are some missing values in tenure

       customer_id  past_3_years_bike_related_purchases       tenure
count  4000.000000                          4000.000000  3913.000000
mean   2000.500000                            48.890000    10.657041
std    1154.844867                            28.715005     5.660146
min       1.000000                             0.000000     1.000000
25%    1000.750000                            24.000000     6.000000
50%    2000.500000                            48.000000    11.000000
75%    3000.250000                            73.000000    15.000000
max    4000.000000                            99.000000    22.000000

In [32]:
df1.isnull().sum() # finding out which values are missing

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                  87
dtype: int64

In [9]:
df1.duplicated().sum() # no duplicated data

0

In [10]:
df1['gender'].value_counts() # we can see here there are some variable missspelled

Female    2037
Male      1872
U           88
Femal        1
M            1
F            1
Name: gender, dtype: int64

In [11]:
df1['gender']=df1['gender'].replace('F','Female').replace('M','Male').replace('Femal','Female').replace('U','NaN')

In [12]:
df1['gender'].value_counts() # checking if the values are fixed

Female    2039
Male      1873
NaN         88
Name: gender, dtype: int64

In [36]:
df2=pd.read_excel("CustomerAddress.xlsx")
df2.head() # we can see that numbers are missing for addresses.

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [38]:
df2.info() # no missing data here
df2.isnull().sum() # no missing values check

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [40]:
dup2= df2.duplicated()
df2[dup2].sum() # no duplicated values

customer_id           0.0
address               0.0
postcode              0.0
state                 0.0
country               0.0
property_valuation    0.0
dtype: float64

In [45]:
df2['state'].value_counts() # values are wrote incorrectly for New South Wales
df2['country'].value_counts()

Australia    3999
Name: country, dtype: int64